Examinator/src/Documents/НаполнениеБиблиотекиПользователейСУО/НаполнениеБиблиотекиПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НаполнениеБиблиотекиПользователейСУО</name>
  <registerRecords>InformationRegister.БиблиотекаПользователейСУО</registerRecords>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Книги</name>
    <attributes>
      <name>Книга</name>
      <type>
        <types>CatalogRef.ЛитератураСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Фрагмент</name>
      <type>
        <types>CatalogRef.СодержаниеКнигиСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>МеткаВБиблиотеке</name>
      <type>
        <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭлектронныеРесурсы</name>
    <attributes>
      <name>ЭлектронныйРесурс</name>
      <type>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Фрагмент</name>
      <type>
        <types>CatalogRef.СодержаниеСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МеткаВБиблиотеке</name>
      <type>
        <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Файлы</name>
    <attributes>
      <name>Файл</name>
      <type>
        <types>CatalogRef.Файлы</types>
      </type>
    </attributes>
    <attributes>
      <name>МеткаВБиблиотеке</name>
      <type>
        <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УчебныеГруппы</name>
    <attributes>
      <name>УчебнаяГруппа</name>
      <type>
        <types>CatalogRef.УчебныеГруппыСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Должности</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеОрганизации</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизацииСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодразделенияПредприятия</name>
    <attributes>
      <name>ПодразделениеПредприятия</name>
      <type>
        <types>CatalogRef.ПодразделенияПредприятияСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоДокументаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/InformationRegisters/БиблиотекаПользователейСУО/БиблиотекаПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БиблиотекаПользователейСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Метка</name>
    <type>
      <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Библиотека</name>
    <type>
      <types>CatalogRef.КаталогМероприятийСУО</types>
      <types>CatalogRef.СхемыМероприятийСУО</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.ЛитератураСУО</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.ЗаданияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Фрагмент</name>
    <type>
      <types>CatalogRef.СодержаниеКнигиСУО</types>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Documents/НаполнениеБиблиотекиПользователейСУО/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда 
    	Возврат; 
	КонецЕсли;			
	
	ДополнительныеСвойства.Вставить("РаспределитьОбновлениеВебКабинетаПоПользователям", Истина);
	ДополнительныеСвойства.Вставить("ИмяОбъектаМетаданныхОбновленияВебКабинета", "РегистрСведений.БиблиотекаПользователейСУО");
	
	ДополнительныеСвойства.Вставить("ПользователиДоЗаписи",
		РегистрыСведений.БиблиотекаПользователейСУО.ПользователиРегистратора(Ссылка));
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда 
    	Возврат; 
	КонецЕсли;				
	
	ДополнительныеСвойства.Вставить("ПользователиПослеЗаписи",
		Документы.НаполнениеБиблиотекиПользователейСУО.ПользователиДокумента(ЭтотОбъект));

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	МассивПользователей = ДополнительныеСвойства.ПользователиПослеЗаписи;
	
	// Делаем движения
	
	Движения.БиблиотекаПользователейСУО.Записывать = Истина;
	
	Для Каждого Пользователь Из МассивПользователей Цикл
	
		Для Каждого Строка Из ЭлектронныеРесурсы Цикл
			
			Движение = Движения.БиблиотекаПользователейСУО.Добавить();
			Движение.Период       = Дата;
			Движение.Пользователь = Пользователь;
			Движение.Ресурс       = Строка.Электронныйресурс;
			Движение.Фрагмент     = Строка.Фрагмент;
			Движение.Метка        = Строка.МеткаВБиблиотеке;
			
			Если ЗначениеЗаполнено(Движение.Метка) Тогда
				Движение.Библиотека = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Движение.Метка, "Владелец");
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого Строка Из Книги Цикл
			
			Движение = Движения.БиблиотекаПользователейСУО.Добавить();
			Движение.Период       = Дата;
			Движение.Пользователь = Пользователь;
			Движение.Ресурс       = Строка.Книга;
			Движение.Фрагмент     = Строка.Фрагмент;
			Движение.Метка        = Строка.МеткаВБиблиотеке;
			
			Если ЗначениеЗаполнено(Движение.Метка) Тогда
				Движение.Библиотека = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Движение.Метка, "Владелец");
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого Строка Из Файлы Цикл
			
			Движение = Движения.БиблиотекаПользователейСУО.Добавить();
			Движение.Период       = Дата;
			Движение.Пользователь = Пользователь;
			Движение.Ресурс       = Строка.Файл;
			Движение.Метка        = Строка.МеткаВБиблиотеке;
			
			Если ЗначениеЗаполнено(Движение.Метка) Тогда
				Движение.Библиотека = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Движение.Метка, "Владелец");
			КонецЕсли;
			
		КонецЦикла;		
		
	КонецЦикла;
	
	Движения.Записать();
	
	
	
КонецПроцедуры


#КонецОбласти
	

#КонецЕсли
